public class Tasck45 {
    // hw-3SergyHodak
    // файл uid.txt c личным идентификатором 71910
    // файл ATM.java с кодом из Tasck44
    // https://github.com/SergeyHodak/hw-3SergyHodak.git    == https://github.com/SergeyHodak/hw-3SergyHodak
}
/*
    Задача - залить код на github
    Создай новый публичный github репозиторий, в названии которого есть текст hw-3.
    Добавь в корень репозитория файл uid.txt с твоим личным идентификатором (узнать его можно, написав боту слово uid).
    Также добавь в корень репозитория файл ATM.java, в котором будет исходный код для подсчета банкнот, которые должен выдать банкомат.
    Отправь ссылку на репозиторий в редактор java-кода и нажми на кнопку Проверить.
 */